---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceOriginZ
source: html/be860511-48c5-cb97-5a67-40525438a962.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceOriginZ Property

"Origin (Z)"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisSurfaceOriginZ { get; }
```